In [1]:
import os
import pandas as pd
import os

In [170]:
os.getcwd()

'C:\\Users\\orena\\OneDrive\\02_JOBS\\IOM\\08_KNOWLEDGE\\07_Skills\\Excel'

In [2]:
%%sql sqlite:///chinook.db

UsageError: Cell magic `%%sql` not found.

In [3]:
import sqlite3

In [4]:
conn = sqlite3.connect('chinook.db')

In [5]:
cursor = conn.cursor()

In [16]:
cursor.execute("SELECT * FROM Employees")

In [14]:
cursor.execute("SELECT Firstname, LastName, Hiredate FROM Employees")

In [17]:
# Fetch one result
result = cursor.fetchone()
print(result)

# Fetch all results
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com')
(2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com')
(3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com')
(4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com')
(5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')
(6, 'Mitchell', 'Michael', 'IT Manager', 1, '1973-07-01 00:00:00', '2003-10-17 00:00:00', '5827 Bowness Road NW', 'Calgary', 'AB', 'Canada', 'T3B 0C5', '+1 (403) 246-9887', '+1 (403) 246-9899', 'michael@chinookcorp.com')
(7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2004-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com')
(8, 'Callahan', 'Laura', 'IT Staff', 6, '1968-01-09 00:00:00', '2004-03-04 00:00:00', '923 7 ST NW', 'Lethbridge', 'AB', 'Canada', 'T1H 1Y8', '+1 (403) 467-3351', '+1 (403) 467-8772', 'laura@chinookcorp.com')

In [ ]:
%%sql

Select 
  FirstName,
  LastName,
  HireDate
FROM
  employees;

In [171]:
# df = pd.read_csv(r"C:\Users\orena\OneDrive\01_ORENAIKE\02_CAREER AND DEVELOPMENTS\01_Schools\ALX\Codes\c-practise\practise_data.csv")
df_excel = pd.read_excel(r"C:\Users\orena\OneDrive\01_ORENAIKE\02_CAREER AND DEVELOPMENTS\01_Schools\ALX\Codes\c-practise\Data _Practise.xlsx", sheet_name= "B2 - BaselineM")

In [172]:
df.head(2)

,Unnamed: 0,id,Conso_Col,date_of_survey,Language
0,1,423679_Somalia_4_2021,Forced movement due to Conflict,44316,English
1,2,423681_Somalia_4_2021,Economic reasons,44308,English

In [173]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199855 entries, 0 to 199854
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Unnamed: 0      199855 non-null  int64
 1   id              199855 non-null  object
 2   Conso_Col       171998 non-null  object
 3   date_of_survey  199855 non-null  int64
 4   Language        199855 non-null  object
dtypes: int64(2), object(3)
memory usage: 7.6+ MB

In [174]:
df_excel.describe()

,type_of_interview/observation,type_of_interview/phone_call,type_of_interview/face_to_face,assessment_round_num,_automatic_coordinates_latitude,_automatic_coordinates_longitude,_automatic_coordinates_altitude,_automatic_coordinates_precision,manual_long,manual_lat,number_of_households_return,num_of_individuals_return,_index
count,63.0,63.000000,63.000000,63.000000,28.000000,28.000000,28.000000,28.000000,34.000000,34.000000,35.000000,35.000000,63.000000
mean,0.0,0.238095,0.761905,3.587302,0.653564,42.108493,34.544816,130.568714,41.897702,1.228642,114.428571,686.571429,235.190476
std,0.0,0.429339,0.429339,7.268214,1.421840,0.565779,45.323852,660.349330,0.486428,2.055879,152.982368,917.894210,290.146951
min,0.0,0.000000,0.000000,1.000000,-0.342233,41.003239,-17.104586,3.920000,40.997158,-1.281331,1.000000,6.000000,1.000000
25%,0.0,0.000000,1.000000,1.000000,-0.340842,42.062031,-0.807406,4.599250,41.729623,-0.979506,10.500000,63.000000,30.500000
50%,0.0,0.000000,1.000000,1.000000,0.399673,42.185428,34.244261,4.916000,41.818393,0.868824,50.000000,300.000000,123.000000
75%,0.0,0.000000,1.000000,1.000000,0.523802,42.561196,50.509998,7.362750,42.148897,3.315653,130.000000,780.000000,265.000000
max,0.0,1.000000,1.000000,29.000000,4.162264,42.602035,158.760012,3500.000000,42.775421,3.840290,500.000000,3000.000000,1062.000000

In [175]:
df.columns 
df.head()

,Unnamed: 0,id,Conso_Col,date_of_survey,Language
0,1,423679_Somalia_4_2021,Forced movement due to Conflict,44316,English
1,2,423681_Somalia_4_2021,Economic reasons,44308,English
2,3,423722_Somalia_4_2021,Access to services,44309,English
3,4,423750_Somalia_4_2021,Economic reasons,44299,English
4,5,423753_Somalia_4_2021,Access to services,44299,English

In [176]:
df["id"].value_counts(dropna=False)

423679_Somalia_4_2021      1
13706_Somalia_5_2018       1
1264463_Burundi_1_2022     1
1264503_Burundi_1_2022     1
1264524_Burundi_1_2022     1
                          ..
1568473_Somalia_12_2022    1
1568611_Somalia_12_2022    1
1605722_Ethiopia_1_2023    1
1588514_Djibouti_1_2023    1
547118_Somalia_9_2021      1
Name: id, Length: 199855, dtype: int64

In [177]:
df_test = {"name":"Tosin", "age":23, "class": 23}
# type(df_test)

df_testdf = pd.DataFrame([df_test])
df_test

{'name': 'Tosin', 'age': 23, 'class': 23}

In [178]:
import pandas as pd

df_test = {"name": "Tosin", "age": 23, "class": 22}

df_test_df = pd.DataFrame([df_test])
print(df_test_df)

    name  age  class
0  Tosin   23     22

In [179]:
import pandas as pd

df_test = pd.DataFrame({"names": ["Tosin", "Bola", "Bola"], "age": [23,20, 20], "class": [3,2,2]})
df_test

# df_test.value_counts().sort_values(ascending=False)

df_test.apply(pd.Series.value_counts)
df_test["names"].value_counts()

Bola     2
Tosin    1
Name: names, dtype: int64

In [180]:
df_test2 = pd.read_csv(r"C:\Users\orena\OneDrive\01_ORENAIKE\02_CAREER AND DEVELOPMENTS\01_Schools\ALX\Codes\c-practise\practise_data2.csv")

C:\Users\orena\AppData\Local\Temp\ipykernel_25264\1210752479.py:1: DtypeWarning: Columns (1,2,4) have mixed types. Specify dtype option on import or set low_memory=False.
  df_test2 = pd.read_csv(r"C:\Users\orena\OneDrive\01_ORENAIKE\02_CAREER AND DEVELOPMENTS\01_Schools\ALX\Codes\c-practise\practise_data2.csv")

In [181]:
df_test2["id"].value_counts().sort_values(ascending=False)

423679_Somalia_4_2021     2
423681_Somalia_4_2021     2
423722_Somalia_4_2021     2
423750_Somalia_4_2021     1
423753_Somalia_4_2021     1
4243_Ethiopia_7_2018      1
4286_Ethiopia_7_2018      1
4331_Ethiopia_11_2018     1
438021_Somalia_2_2021     1
438031_Somalia_2_2021     1
438065_Somalia_2_2021     1
438083_Somalia_2_2021     1
438140_Somalia_2_2021     1
586796_Djibouti_9_2021    1
586798_Djibouti_9_2021    1
Name: id, dtype: int64

In [182]:
# df_test2.apply(pd.Series.value_counts)
df_test2

,Unnamed: 0,id,Conso_Col,date_of_survey,Language
0,1.0,423679_Somalia_4_2021,Forced movement due to Conflict,44316.0,English
1,2.0,423681_Somalia_4_2021,Economic reasons,44308.0,English
2,3.0,423722_Somalia_4_2021,Access to services,44309.0,English
3,4.0,423679_Somalia_4_2021,Forced movement due to Conflict,44316.0,English
4,5.0,423681_Somalia_4_2021,Economic reasons,44308.0,English
...,...,...,...,...,...
170014,NaN,NaN,NaN,NaN,NaN
170015,NaN,NaN,NaN,NaN,NaN
170016,NaN,NaN,NaN,NaN,NaN
170017,NaN,NaN,NaN,NaN,NaN
170018,NaN,NaN,NaN,NaN,NaN

In [183]:
df.value_counts().sort_values(ascending = False)

Unnamed: 0  id                      Conso_Col                                      date_of_survey  Language
1           423679_Somalia_4_2021   Forced movement due to Conflict                44316           English     1
21          587070_Djibouti_9_2021  Economic reasons                               44458           English     1
20          587048_Djibouti_9_2021  Economic reasons                               44457           English     1
3           423722_Somalia_4_2021   Access to services                             44309           English     1
4           423750_Somalia_4_2021   Economic reasons                               44299           English     1
                                                                                                              ..
199849      546839_Somalia_8_2021   Access to services (e.g. health, food, water)  44433           French      1
199850      546840_Somalia_8_2021   Economic reasons                               44433           English     1
199851      5469_Ethiopia_9_2018    Economic reasons                               43347           English     1
199852      546968_Somalia_8_2021   Economic reasons                               44413           English     1
199855      547118_Somalia_9_2021   Economic reasons                               44466           English     1
Length: 171998, dtype: int64

In [219]:
# df_test2.columns
# dup = df_test2["id"].value_counts()

# print(dup)
type(dup) #pandas.core.series.Series
# type(df_test2) #pandas.core.frame.DataFrame
# dup[dup > 1]

# df_test2["id"].value_counts()[df_test2["id"].value_counts() > 1]

df_test2.head()

,Unnamed: 0,id,Conso_Col,date_of_survey,Language
0,1.0,423679_Somalia_4_2021,Forced movement due to Conflict,44316.0,English
1,2.0,423681_Somalia_4_2021,Economic reasons,44308.0,English
2,3.0,423722_Somalia_4_2021,Access to services,44309.0,English
3,4.0,423679_Somalia_4_2021,Forced movement due to Conflict,44316.0,English
4,5.0,423681_Somalia_4_2021,Economic reasons,44308.0,English

In [1]:
import base64

# Original string
original_string = "hello world"

# Convert string to bytes
original_string_bytes = original_string.encode("utf-8")

# Base64 encode
base64_bytes = base64.b64encode(original_string_bytes)

# Convert Base64 bytes to string
base64_string = base64_bytes.decode("utf-8")

print("Original string:", original_string)
print("Base64 encoded string:", base64_string)

Original string: hello world
Base64 encoded string: aGVsbG8gd29ybGQ=

Practise

In [8]:
list = [1,2,3,1,2]
index = 1

def replace_c(list, index, element2replace):
  if index < 0 or index >= len(list):
    return list
  list[index] = element2replace
  return list
  
newlist = replace_c(list, index, 23)

print("Newlist: ", newlist)

Newlist:  [1, 23, 3, 1, 2]

In [15]:
list = [2,36,7,2]
index = 2

def replaceList(list, index, elem):
  if index < 0 or index >= len(list):
    return list
  list[index] = elem
  return list

newlistv1 = replaceList(list, 1, 100)
print(newlistv1)

[2, 100, 7, 2]

In [20]:
#Lambda argument: expression

function = lambda y,z,x: y + z * x
result = function(2,1,4)
print(result)

6

In [24]:
def addTo(x, y, z):
  result = x + y + z
  assert x > 2, "x needs to be greater than 2"
  return result

outcome = addTo(2,1,3)
print(outcome)

AssertionError: x needs to be greater than 2

In [25]:
listv2 = [2, 4, 7, 8]
def replacelistv2(listv2,  indexv2, elementv2):
  if indexv2 < 0 or indexv2 >= len(listv2):
    return listv2
  listv2[indexv2] = elementv2
  return listv2

newlistv2 = replacelistv2(listv2, 3, 399)
print(newlistv2)

[2, 4, 7, 399]

In [26]:
add = lambda x,y,z: x+y+z

result = add(2,4,5)
print(result)

11

In [3]:
dictExample = {"Name": "Tosin", "Age":"class"}
type(dictExample)

dict

Applicatiion Program Interphase